package javaStudy;
/*
 * 자바의 기본 : 위에 있는 패키지는 나중에 배울테니 지금은 무시하세요.
 * 
 * 주의사항
 * 
 * 1. 아래의 소스코드에서 보라색은 키워드(단어 자체가 의미를 내포하고 있다는 뜻)입니다.
 * 이 키워드는 변수나 클래스 이름등으로 사용하면 절대 안됩니다. 
 * 
 * 2. 아래의 public 은 있어도 없어도 상관없음(나중에 배움) 그러니 이것때문에 신경쓰지 마세요.
 * 
 * 3. 모든 키워드와 키워드, 클래스 이름중간에는 반드시 공백이 들어가야 인식합니다.
 * 공백이 없으면 하나의 단어로 인식합니다. 
 * 
 * 4. 클래스 이름 옆에는 반드시 {}를 사용하고, 앞으로 {} 를 클래스옆에 붙은, 클래스를 정의한 
 * 내용이 있는 블락 이라고 해서 클래스 바디(BODY) 라고 부릅니다.
 * 
 * 5. 클래스 이름은 반드시 첫자는 대문자로 시작해야 합니다.(반드시!!!!!!!!!!!!)
 * 일주일이 지난 후에도 이걸 지키지 않는 사람은 제가 질책을 할 예정이니 반드시 꼭 지키세요.
 * 
 * 6. 자바내의 데이터를 제외한 모든 코드에는 한글 사용하지 마세요.
 * 
 * 7.클래스명에 특문은 숫자, $, _ 등만 허용됩니다. 단, 숫자는 반드시 두번째부터 허용 가능합니다. 
 * 처음부터 숫자로 시작하면 컴파일 에러 입니다. 
 * 
 * 8. 자바는 문법에 매우 엄격하기 때문에, 모든 실행, 선언, 초기화 구문 끝에는 반드시 ; 를 사용해서 
 * 구문을 구분지어 줘야 합니다.
 * 
 * 9. 하나의 자바 소스 파일내에는 하나 이상의 클래스를 정의 할수 있습니다. 단, Public 키워드는 단 하나의 클래스만 가질수 있고,
 * 한번 이상 사용하면 에러입니다. 또한 이 public 을 가진 클래스가 대표 클래스가 되고, main 메서드를 갖게 되며, 파일명을 이 클래스명으로 합니다.
 *  */

public class SyntaxEx {

	
}
